# 8.1 Hierarchial Indexing

In [96]:
import pandas as pd
import numpy as np

In [6]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], 
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    1.309694
   2   -0.193560
   3    0.638223
b  1   -0.953791
   3   -0.710222
c  1    0.318439
   2    0.242723
d  2   -0.437999
   3    1.161385
dtype: float64

In [7]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [8]:
data['b']

1   -0.953791
3   -0.710222
dtype: float64

In [9]:
data['b':'c']

b  1   -0.953791
   3   -0.710222
c  1    0.318439
   2    0.242723
dtype: float64

In [10]:
data.loc[['d', 'b']]

d  2   -0.437999
   3    1.161385
b  1   -0.953791
   3   -0.710222
dtype: float64

In [11]:
data.loc[:, 2]

a   -0.193560
c    0.242723
d   -0.437999
dtype: float64

In [12]:
data.unstack()

          1         2         3
a  1.309694 -0.193560  0.638223
b -0.953791       NaN -0.710222
c  0.318439  0.242723       NaN
d       NaN -0.437999  1.161385

In [13]:
data.unstack().stack()

a  1    1.309694
   2   -0.193560
   3    0.638223
b  1   -0.953791
   3   -0.710222
c  1    0.318439
   2    0.242723
d  2   -0.437999
   3    1.161385
dtype: float64

In [26]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [27]:
frame.columns.names = ['STATE', 'COLOR']
frame.index.names = ['KEY1', 'KEY2']
frame

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY1 KEY2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [28]:
frame['Ohio']

COLOR      Green  Red
KEY1 KEY2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [29]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], 
                      names=['STATE', 'COLOR'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['STATE', 'COLOR'])

## Reordering and Sorting Levels

In [33]:
frame

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY1 KEY2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [30]:
frame.swaplevel('KEY1', 'KEY2')

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY2 KEY1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [31]:
frame.sort_index(level=1)

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY1 KEY2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [35]:
frame.swaplevel(0, 1).sort_index(level=0)

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY2 KEY1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## Summary Statistics by level

In [37]:
frame

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY1 KEY2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [36]:
# Row 1, Col 'Green': sum of index 1 in KEY1 {a, b}
frame.sum(level='KEY2')

STATE  Ohio     Colorado
COLOR Green Red    Green
KEY2
1         6   8       10
2        12  14       16

In [39]:
# Row 1, Col 'Green': sum of column 'GREEN' in 'Ohio' & 'Colorado' for index 1
frame.sum(level='COLOR', axis=1)

COLOR      Green  Red
KEY1 KEY2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## Indexing with a DataFrame's Columns

In [40]:
frame = pd.DataFrame({'a': range(7),
                      'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [41]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [42]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [45]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# 8.2 Combining and Merging Datasets

### Many-to-One merge

In [53]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [54]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [55]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [56]:
# data2 has multiple rows same data where the key were overlapping.
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [57]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [60]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

### Many-to-Many merge

Cartesian product

In [63]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [64]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [65]:
# Many-to-may joins form the cartesian product
# 3 rows of key'b' in df1 and 2 in df2; resulting in 6 rows in merge
pd.merge(df1, df2,  on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [66]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [68]:
# To merge with multiple keys
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4 , 5, 6, 7]})
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [69]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [70]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [71]:
# Overlapping columns with same name but not included in merge operation
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [74]:
pd.merge(left, right, on='key1', suffixes=['_left', '_right'])

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

## Merging on Index

In [83]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                     'value': range(6)})
right1 =  pd.DataFrame({'group_val': [3.5, 7]},
                        index= ['a', 'b'])
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [84]:
right1

   group_val
a        3.5
b        7.0

In [85]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [86]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [88]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 20002]])
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [89]:
righth

               0   1
Nevada 2001    0   1
       2000    2   3
Ohio   2000    4   5
       2000    6   7
       2001    8   9
       20002  10  11

In [91]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1   key2  data     0     1
0    Ohio   2000   0.0   4.0   5.0
0    Ohio   2000   0.0   6.0   7.0
1    Ohio   2001   1.0   8.0   9.0
2    Ohio   2002   2.0   NaN   NaN
3  Nevada   2001   3.0   0.0   1.0
4  Nevada   2002   4.0   NaN   NaN
4  Nevada   2000   NaN   2.0   3.0
4    Ohio  20002   NaN  10.0  11.0

In [93]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

     key1   key2  data     0     1
0    Ohio   2000   0.0   4.0   5.0
0    Ohio   2000   0.0   6.0   7.0
1    Ohio   2001   1.0   8.0   9.0
2    Ohio   2002   2.0   NaN   NaN
3  Nevada   2001   3.0   0.0   1.0
4  Nevada   2002   4.0   NaN   NaN
4  Nevada   2000   NaN   2.0   3.0
4    Ohio  20002   NaN  10.0  11.0

In [102]:
# Using indexes of both sides of the merge 
left2 = pd.DataFrame([[1.,2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9, 10], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [103]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [104]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [105]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [106]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [107]:
another = pd.DataFrame([[7., 8.], [9.,  10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregeon'])
another

   New York  Oregeon
a       7.0      8.0
c       9.0     10.0
e      11.0     12.0
f      16.0     17.0

In [108]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregeon
a   1.0     2.0       NaN      NaN       7.0      8.0
c   3.0     4.0       9.0     10.0       9.0     10.0
e   5.0     6.0      13.0     14.0      11.0     12.0

In [109]:
left.join([right2, another], how='outer')

  key1 key2  lval  Missouri  Alabama  New York  Oregeon
0  foo  one   1.0       NaN      NaN       NaN      NaN
1  foo  two   2.0       NaN      NaN       NaN      NaN
2  bar  one   3.0       NaN      NaN       NaN      NaN
a  NaN  NaN   NaN       NaN      NaN       7.0      8.0
b  NaN  NaN   NaN       7.0      8.0       NaN      NaN
c  NaN  NaN   NaN       9.0     10.0       9.0     10.0
d  NaN  NaN   NaN      11.0     12.0       NaN      NaN
e  NaN  NaN   NaN      13.0     14.0      11.0     12.0
f  NaN  NaN   NaN       NaN      NaN      16.0     17.0

## Concatenating Along an Axis

In [116]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [117]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [124]:
# Concatenating in Pandas
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [125]:
# By default axis=0
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [129]:
# axis=1 is column
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [130]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [134]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [135]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [136]:
# join_axes deprecated
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [138]:
result = pd.concat([s1, s1, s2 ], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  c    2
       d    3
       e    4
dtype: int64

In [139]:
result.unstack()

         a    b    c    d    e
one    0.0  1.0  NaN  NaN  NaN
two    0.0  1.0  NaN  NaN  NaN
three  NaN  NaN  2.0  3.0  4.0

In [140]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [142]:
df1 = pd.DataFrame(np.arange(6).reshape((3,2)), index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = pd.DataFrame(5+np.arange(4).reshape((2, 2)), index=['a', 'c'], columns=['three', 'fpur'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [143]:
df2

   three  fpur
a      5     6
c      7     8

In [144]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three fpur
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [146]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three fpur
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [147]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'], names=['upper', 'lower'])

upper level1     level2
lower    one two  three fpur
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [149]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df1

          a         b         c         d
0  0.160512 -1.479768  0.691601  1.037095
1 -0.389363 -0.000411 -0.976539  0.546307
2  1.208796  2.244040  0.818968 -1.537265

In [153]:
df2

          b         d         a
0 -0.020807  1.452972  1.714650
1 -0.198109  1.787619 -0.502403

In [154]:
# ignore_index: df in which the row index does not contains relevant data
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  0.160512 -1.479768  0.691601  1.037095
1 -0.389363 -0.000411 -0.976539  0.546307
2  1.208796  2.244040  0.818968 -1.537265
3  1.714650 -0.020807       NaN  1.452972
4 -0.502403 -0.198109       NaN  1.787619

## Combining Data with Overlap

In [157]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a)), dtype=np.float64, 
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1] = np.nan
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [158]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [160]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [161]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [162]:
# combine_first: "patching" missing data column-by-column in the calling object with the data from the object you pass
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6,], 
                    'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [163]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [165]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

# 8.3 Reshaping and Pivoting

In [175]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [187]:
# using the stack method on this data pivots the columns into rows and produce a Series
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [169]:
#By default innermost level is stacked/Unstacked.
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [170]:
# By passing a level number or name, unstack different level
# But cannot stack different level other than innermost level
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [171]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [179]:
result = data.stack('number')
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [182]:
# Unstacking might introduce missing data if all the values in the level  aren't found in each of the subgroups

s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2,], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [183]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [184]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [186]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

### Unstack in a dataframe, the level unstacked becomes the lowest level in the result

In [188]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [191]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [192]:
# When calling stack, we can indicate the name of the axis to stack
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

## Pivoting "Long" to " Wide" format

In [203]:
data = pd.read_csv('datasets/macrodata.csv')
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [206]:
periods = pd.PeriodIndex(year=data.year, 
                         quarter=data.quarter,
                         name='date')
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
data = data.reindex(columns=columns)
data.index = periods.to_timestamp('D', 'end')
ldata = data.stack().reset_index().rename(columns={0: 'value'})

### Long Format
Data is usually stored like this in "long-format" in db. But it might be difficult to work in this form.

In [207]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

You may actually want a column for each item vaue indexed by date. **Pivot it**.
First two vales are the column to use as ***row index***, ***column index***

Finally optional ***value column*** to fill dataframe

In [211]:
pivoted = ldata.pivot('date', 'item', 'value')
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

### Suppose you wanted to reshape simulatenously

In [215]:
ldata['value2'] = np.random.randn(len(ldata))
ldata[:3]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.257558
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.002661
2 1959-03-31 23:59:59.999999999    unemp     5.800  1.477991

In [216]:
# By omitting last argument, you get df with hierarchical columns
pivoted = ldata.pivot('date', 'item')
pivoted[:3]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.002661  0.257558
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  0.976123  0.889725
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  0.641376  0.069034


item                              unemp
date
1959-03-31 23:59:59.999999999  1.477991
1959-06-30 23:59:59.999999999 -0.618705
1959-09-30 23:59:59.999999999  0.131512

In [219]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')
unstacked[:3]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.002661  0.257558
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  0.976123  0.889725
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  0.641376  0.069034


item                              unemp
date
1959-03-31 23:59:59.999999999  1.477991
1959-06-30 23:59:59.999999999 -0.618705
1959-09-30 23:59:59.999999999  0.131512

## Pivoting "Wide" to "Long" Format

In [220]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3], 
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

### When using pd.melt, we must indicate which columns are group indicator

In [238]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [236]:
# using pivot, we can reshpae back to original lasyout
reshaped = melted.pivot('key', 'variable', 'value')
reshaped.columns.name = None
reshaped

     A  B  C
key
bar  2  5  8
baz  3  6  9
foo  1  4  7

In [239]:
# use reset_index() to move data back into a column
reshaped.reset_index()

   key  A  B  C
0  bar  2  5  8
1  baz  3  6  9
2  foo  1  4  7

### You can also specify a subset of column to use as value columns

In [240]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

### Can be also used without any group identifiers

In [241]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [242]:
pd.melt(df, value_vars=['key', 'A', 'B', 'C'])

   variable value
0       key   foo
1       key   bar
2       key   baz
3         A     1
4         A     2
5         A     3
6         B     4
7         B     5
8         B     6
9         C     7
10        C     8
11        C     9